In [1]:
import pandas as pd

data = pd.Series((0.25, 0.5, 0.75, 1.0))
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [4]:
data = pd.Series((0.25, 0.5, 0.75, 1.0), index = ['1r mor', '2r mor','3r mor','4r mor',])
data

1r mor    0.25
2r mor    0.50
3r mor    0.75
4r mor    1.00
dtype: float64

In [5]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [6]:
data.index

Index(['1r mor', '2r mor', '3r mor', '4r mor'], dtype='object')

In [9]:
import numpy as np
states = pd.DataFrame(np.random.rand(3,2), columns = ['Col 1', 'Col 2'], index = ['a', 'b', 'c'])
states

      Col 1     Col 2
a  0.869573  0.473461
b  0.255981  0.219543
c  0.443695  0.611033

In [12]:
data[2]
# data[c]

0.75

In [13]:
list(data.items())

[('1r mor', 0.25), ('2r mor', 0.5), ('3r mor', 0.75), ('4r mor', 1.0)]

In [14]:
list(data.items())[2]

('3r mor', 0.75)

In [15]:
data.keys()[2]

'3r mor'

In [17]:
data['5r mor'] = 1.25
data

1r mor    0.25
2r mor    0.50
3r mor    1.25
4r mor    1.00
5r mor    1.25
dtype: float64

In [19]:
data['1r mor':'2r mor']

1r mor    0.25
2r mor    0.50
dtype: float64

In [20]:
data[(data > 0.3) & (data < 1.25)]

2r mor    0.5
4r mor    1.0
dtype: float64

In [21]:
data[0:3]

1r mor    0.25
2r mor    0.50
3r mor    1.25
dtype: float64

In [22]:
data1 = pd.Series(['a', 'b', 'c'], index = [1, 3, 5])
data1

1    a
3    b
5    c
dtype: object

In [23]:
data1[1]

'a'

In [24]:
data1.loc[1]

'a'

In [25]:
data1.iloc[1]

'b'

In [26]:
data[1:3]

2r mor    0.50
3r mor    1.25
dtype: float64

In [27]:
data1.loc[1:3]

1    a
3    b
dtype: object

In [28]:
data1.iloc[1:3]

3    b
5    c
dtype: object

In [29]:
area = pd.Series({'California': 423967, 'Texas': 695662, 'New York': 141297})
pop = pd.Series({'California': 38332521, 'Texas': 26448193, 'New York': 19651127})
data = pd.DataFrame({'area': area, 'pop': pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [30]:
data['area']

California    423967
Texas         695662
New York      141297
Name: area, dtype: int64

In [31]:
data.area

California    423967
Texas         695662
New York      141297
Name: area, dtype: int64

In [32]:
data.area is data['area']

True

In [33]:
data['density'] = data['pop'] / data['area']
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746

In [34]:
data.index[0]

'California'

In [35]:
data.columns[0]

'area'

In [36]:
data.values[0]

array([4.23967000e+05, 3.83325210e+07, 9.04139261e+01])

In [37]:
data.T

           California         Texas      New York
area     4.239670e+05  6.956620e+05  1.412970e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07
density  9.041393e+01  3.801874e+01  1.390767e+02

In [46]:
data.iloc[:3, :3]

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746

In [50]:
data.loc[:'California', :'pop']

              area       pop
California  423967  38332521

In [51]:
data.loc[data.density > 100, ['pop', 'density']]

               pop     density
New York  19651127  139.076746

In [59]:
data.iloc[0, 2] = 90
data

              area       pop     density
California      90        90   90.000000
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746

In [60]:
data['California': 'Texas']

              area       pop   density
California      90        90  90.00000
Texas       695662  26448193  38.01874

In [63]:
data[1:3]

            area       pop     density
Texas     695662  26448193   38.018740
New York  141297  19651127  139.076746

In [68]:
data[data.density > 100]

            area       pop     density
New York  141297  19651127  139.076746